MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV16KA301/mcu.h
#define _CTMUICON_IRNG_POSITION                  0x00000008
#define _CTMUICON_IRNG_MASK                      0x00000300
#define _CTMUICON_IRNG_LENGTH                    0x00000002

#define _CTMUICON_ITRIM_POSITION                 0x0000000A
#define _CTMUICON_ITRIM_MASK                     0x0000FC00
#define _CTMUICON_ITRIM_LENGTH                   0x00000006

#define _CTMUICON_IRNG0_POSITION                 0x00000008
#define _CTMUICON_IRNG0_MASK                     0x00000100
#define _CTMUICON_IRNG0_LENGTH                   0x00000001

#define _CTMUICON_IRNG1_POSITION                 0x00000009
#define _CTMUICON_IRNG1_MASK                     0x00000200
#define _CTMUICON_IRNG1_LENGTH                   0x00000001

#define _CTMUICON_ITRIM0_POSITION                0x0000000A
#define _CTMUICON_ITRIM0_MASK                    0x00000400
#define _CTMUICON_ITRIM0_LENGTH                  0x00000001

#define _CTMUICON_ITRIM1_POSITION                0x0000000B
#define _CTMUICON_ITRIM1_MASK                    0x00000800
#define _CTMUICON_ITRIM1_LENGTH                  0x00000001

#define _CTMUICON_ITRIM2_POSITION                0x0000000C
#define _CTMUICON_ITRIM2_MASK                    0x00001000
#define _CTMUICON_ITRIM2_LENGTH                  0x00000001

#define _CTMUICON_ITRIM3_POSITION                0x0000000D
#define _CTMUICON_ITRIM3_MASK                    0x00002000
#define _CTMUICON_ITRIM3_LENGTH                  0x00000001

#define _CTMUICON_ITRIM4_POSITION                0x0000000E
#define _CTMUICON_ITRIM4_MASK                    0x00004000
#define _CTMUICON_ITRIM4_LENGTH                  0x00000001

#define _CTMUICON_ITRIM5_POSITION                0x0000000F
#define _CTMUICON_ITRIM5_MASK                    0x00008000
#define _CTMUICON_ITRIM5_LENGTH                  0x00000001

#define _AD1CTMUENH_CTMEN16_POSITION             0x00000000
#define _AD1CTMUENH_CTMEN16_MASK                 0x00000001
#define _AD1CTMUENH_CTMEN16_LENGTH               0x00000001

#define _AD1CTMUENH_CTMEN17_POSITION             0x00000001
#define _AD1CTMUENH_CTMEN17_MASK                 0x00000002
#define _AD1CTMUENH_CTMEN17_LENGTH               0x00000001

#define _AD1CTMUENH_CTMEN26_POSITION             0x0000000A
#define _AD1CTMUENH_CTMEN26_MASK                 0x00000400
#define _AD1CTMUENH_CTMEN26_LENGTH               0x00000001

#define _AD1CTMUENH_CTMEN27_POSITION             0x0000000B
#define _AD1CTMUENH_CTMEN27_MASK                 0x00000800
#define _AD1CTMUENH_CTMEN27_LENGTH               0x00000001

#define _AD1CTMUENH_CTMEN28_POSITION             0x0000000C
#define _AD1CTMUENH_CTMEN28_MASK                 0x00001000
#define _AD1CTMUENH_CTMEN28_LENGTH               0x00000001

#define _AD1CTMUENH_CTMEN29_POSITION             0x0000000D
#define _AD1CTMUENH_CTMEN29_MASK                 0x00002000
#define _AD1CTMUENH_CTMEN29_LENGTH               0x00000001

#define _AD1CTMUENH_CTMEN30_POSITION             0x0000000E
#define _AD1CTMUENH_CTMEN30_MASK                 0x00004000
#define _AD1CTMUENH_CTMEN30_LENGTH               0x00000001

#define _AD1CTMUENL_CTMEN0_POSITION              0x00000000
#define _AD1CTMUENL_CTMEN0_MASK                  0x00000001
#define _AD1CTMUENL_CTMEN0_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN1_POSITION              0x00000001
#define _AD1CTMUENL_CTMEN1_MASK                  0x00000002
#define _AD1CTMUENL_CTMEN1_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN2_POSITION              0x00000002
#define _AD1CTMUENL_CTMEN2_MASK                  0x00000004
#define _AD1CTMUENL_CTMEN2_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN3_POSITION              0x00000003
#define _AD1CTMUENL_CTMEN3_MASK                  0x00000008
#define _AD1CTMUENL_CTMEN3_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN4_POSITION              0x00000004
#define _AD1CTMUENL_CTMEN4_MASK                  0x00000010
#define _AD1CTMUENL_CTMEN4_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN5_POSITION              0x00000005
#define _AD1CTMUENL_CTMEN5_MASK                  0x00000020
#define _AD1CTMUENL_CTMEN5_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN6_POSITION              0x00000006
#define _AD1CTMUENL_CTMEN6_MASK                  0x00000040
#define _AD1CTMUENL_CTMEN6_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN7_POSITION              0x00000007
#define _AD1CTMUENL_CTMEN7_MASK                  0x00000080
#define _AD1CTMUENL_CTMEN7_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN8_POSITION              0x00000008
#define _AD1CTMUENL_CTMEN8_MASK                  0x00000100
#define _AD1CTMUENL_CTMEN8_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN9_POSITION              0x00000009
#define _AD1CTMUENL_CTMEN9_MASK                  0x00000200
#define _AD1CTMUENL_CTMEN9_LENGTH                0x00000001

#define _AD1CTMUENL_CTMEN10_POSITION             0x0000000A
#define _AD1CTMUENL_CTMEN10_MASK                 0x00000400
#define _AD1CTMUENL_CTMEN10_LENGTH               0x00000001

#define _AD1CTMUENL_CTMEN11_POSITION             0x0000000B
#define _AD1CTMUENL_CTMEN11_MASK                 0x00000800
#define _AD1CTMUENL_CTMEN11_LENGTH               0x00000001

#define _AD1CTMUENL_CTMEN12_POSITION             0x0000000C
#define _AD1CTMUENL_CTMEN12_MASK                 0x00001000
#define _AD1CTMUENL_CTMEN12_LENGTH               0x00000001

#define _AD1CTMUENL_CTMEN13_POSITION             0x0000000D
#define _AD1CTMUENL_CTMEN13_MASK                 0x00002000
#define _AD1CTMUENL_CTMEN13_LENGTH               0x00000001

#define _AD1CTMUENL_CTMEN14_POSITION             0x0000000E
#define _AD1CTMUENL_CTMEN14_MASK                 0x00004000
#define _AD1CTMUENL_CTMEN14_LENGTH               0x00000001

#define _AD1CTMUENL_CTMEN15_POSITION             0x0000000F
#define _AD1CTMUENL_CTMEN15_MASK                 0x00008000
#define _AD1CTMUENL_CTMEN15_LENGTH               0x00000001

#define _ANSA_ANSA0_POSITION                     0x00000000
#define _ANSA_ANSA0_MASK                         0x00000001
#define _ANSA_ANSA0_LENGTH                       0x00000001

#define _ANSA_ANSA1_POSITION                     0x00000001
#define _ANSA_ANSA1_MASK                         0x00000002
#define _ANSA_ANSA1_LENGTH                       0x00000001

#define _ANSA_ANSA2_POSITION                     0x00000002
#define _ANSA_ANSA2_MASK                         0x00000004
#define _ANSA_ANSA2_LENGTH                       0x00000001

#define _ANSA_ANSA3_POSITION                     0x00000003
#define _ANSA_ANSA3_MASK                         0x00000008
#define _ANSA_ANSA3_LENGTH                       0x00000001

